{
  "comments": [
      {
          "comment_id": 1,
          "text": "Just in case you’re concerned you won’t be able to get a $200+ smart toothbrush, you will soon to be able to get a $400 AI powered toothbrush.\n\nMeanwhile, Oral-B is pushing its latest toothbrush to capitalize on the latest AI tech trend. Without real detail, Oral-B claims its new $400 toothbrush has \"A.I. position detection that tracks where you brush across all 3 surfaces of your teeth.” Like many, I'm skeptical about the toothbrush’s incorporation of actual AI; notably, P&G declined to comment to The Washington Post on what, exactly, makes the toothbrush \"AI.\"\nThis is the future we dreamed about as children manifesting before our very own eyes!",
          "metatag": "user feedback"
      },
      {
          "comment_id": 2,
          "text": "what, exactly, makes the toothbrush \"AI.\"\nThe brush is so sharp and hard, you'll scream \"AÏ!\" when you use it",
          "metatag": "user feedback"
      },
      {
          "comment_id": 3,
          "text": "OMG this is like the days when manufactures wanted to say their machines they produced like toasters and refrigerators were internet connected as a marketing point rather than a truly practical use.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 4,
          "text": "Yeah I never thought “I wish my toothbrush had an app, imagine all the cool stuff my toothbrush could do if I could control it via app using WiFi!”\n\nImagine being an app developer and your job was to build out a platform for a toothbrush. I would quiet quit so hard on that shit lol",
          "metatag": "user feedback"
      },
      {
          "comment_id": 5,
          "text": "I have a toothbrush with built-in WiFi. It connects to an app supposedly, but WTF would I need to track, much less let the world track, how and when I brush my teeth?\n\n2026: Mr Observe. I'm afraid your dental insurance will not cover your claim for dentures since you only brushed below average frequency and were inconsistent",
          "metatag": "user feedback"
      },
      {
          "comment_id": 6,
          "text": "As a techy, the concept is fun. The reduced space for a smart brush base doubling as an AI assistant, also water resistant for the humid bathroom, better.\n\nBut yet again, an overly expensive simple concept, under 5 years, support is all but dropped, cut out a feature many considered in their buying, only for the feature to be taken out and told to upgrade.\n\nIt's like your car having surround sound, flipped to mono, and told to upgrade to a newer car to reclaim it. The idea is stupid. Just like paying a subscription in your electric car to use the heated seats.\n\nThen there's the whole \"buying\" media online, not subscription, only to be told later on your \"lease\", again you Bought the content, is up as the actual company that owns the IP said \"no more.\"\n\nWhere do we draw the line to say what we do own, and what we're giving up to people in greed, errr I mean power, that \"knows better for you!\"",
          "metatag": "user feedback"
      },
      {
          "comment_id": 7,
          "text": "I’m sorry but if you’re such a fucking mark that you’re compelled to give 230 bucks for a toothbrush, you deserve whatever inconvenience and/or scam that comes with it",
          "metatag": "user feedback"
      },
      {
          "comment_id": 8,
          "text": "I’ve likely spent around $230 on toothbrushes in my lifetime to date. I brush at least 2x daily and I get a pack with several for a couple bucks. Maybe $8 a year?\n\nUpvote\n5\n\nDownvote\n\nReply\nreply\n\nAward\n\nShare\nShare\n\nsarhoshamiral\n•\n2 mo. ago\nElectric ones are objectively better though but you don't have to get a 230$ one obviously. Our original oralbs were 35$ each and then you just replace the brush. The battery has been going fine for 10 years now.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 9,
          "text": "Alexa is a dumb feature for a toothbrush, but don’t let this turn your off expensive sonic brushes. My dentist noticed when I switched.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 10,
          "text": "I think the idea is to add AI to your toothbrush, then add a web browser, an app store, touchscreen etc…Imagine while all your loser friends have a simple smart phone, you have a smart toothbrush you carry around with you everywhere. That way you can ask your stupid friends “Oh yeah? Well can you phone brush your teeth?!? Didn’t think so!”\n\nThere’s gotta be a market for those bragging rights",
          "metatag": "user feedback"
      },
      {
          "comment_id": 11,
          "text": "I was one of the schmucks who bought this tooth brush (at $50 mind you, nobody should ever spend $230 on any kind of toothbrush). I bought it not for the Alexa function, but because the base has a nice visual lighted indicator for the 2 min timer and also turns red when you are brushing too hard. The Bluetooth speaker was also very loud and handy when I want to play some music while taking a bath. When they stopped supporting it and killed the app they completely killed ALL of the functions of the smart base mentioned above, leaving it just as a dumb charger, except it still blinks annoyingly. There’s no reason they should have removed all the other functions other than Alexa even if they are stopping support. This really shows how callous and greedy Oral B is as a company. Needless to say nobody should have any faith in their ability to stand behind their product and support it long term.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 12,
          "text": "I bought one for $35. It was a game changer. I can go like two weeks easily without charging it. It’s a like $30 more than a regular toothbrush, not $200 or $400.\n\nA regular, standard electric toothbrush is way better than a regular one, not much more expensive, last forever and are relatively cheap to replace.\n\nI can’t imagine why someone would take that product, then add Alexa to it and charge $200 more for it. Like why? It makes no sense",
          "metatag": "user feedback"
      },
      {
          "comment_id": 13,
          "text": "Unlike previous “dumb” toothbrushes, this new AI-powered model will come with 2 distinct benefits.\n\nGreat marketing buzzwords that land with modern consumers\nA nice profit and perceived justification for a massive price tag\nIt also brushes teeth or something idk",
          "metatag": "user feedback"
      },
      {
          "comment_id": 14,
          "text": "FYI Oral B also an electric toothbrush that simply uses 2x AA batteries for power and runs happily on rechargeable. No app, no built-in countdown timer or pressure sensor; but the brush heads are the same as any other Oral B electric toothbrush. They are about $10.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 15,
          "text": "I think 99.9999999% of people agree with you. I had no idea this product even existed before I saw this article. The reason I posted it was because I thought the whole thing was hilarious, especially since they are phasing out their smart toothbrush for a toothbrush with AI built into it. Like why? Why would anyone need ChatGPT built into their toothbrush?",
          "metatag": "user feedback"
      },
      {
          "comment_id": 16,
          "text": "I have an electric toothbrush. I turn it on, brush my teeth, charge it every once in a while, replace the head when it looks a bit frayed. Seems to work great. Why does my toothbrush need Alexa or AI integration?\nAm I just old and out of touch or has the whole world gone crazy?",
          "metatag": "user feedback"
      },
      {
          "comment_id": 17,
          "text": "No need for an AI driven smart toothbrush. Just brush your teeth, use mouthwash, and pop a Xylitol a couple of times a day. Done.",
          "metatag": "user feedback"
      },
      {
          "comment_id": 18,
          "text": "I love it when my toothbrush connects to the Internet. Sure hope it's not sending data or being used in a botnet for DDoS attacks /s",
          "metatag": "user feedback"
      },
      {
          "comment_id": 19,
          "text": "Weird that in a technology sub, people are making fun of technology.\n\nI have the previous smart one. Don’t care at all about the data, but is nice for my smart home setup to know that teeth have been brushed. It feeds into a Bayesian algorithm of other detected activities to indicate that we are likely to be in bed, and takes other actions as a result.",
          "metatag": "user feedback"
      },
      {
        "comment_id": 24,
        "text": "My sister got me a electric toothbrush in 2015. It came with Bluetooth and an app. Used it once just to see what it did. It was such a hassle.\n\nElectric is great, but idk who is actually gonna use a smart toothbrush.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 25,
        "text": "It's also a cautionary tale against putting Alexa in everything. Do you really need an assistant in your toothbrush? No, no you don't. EDIT: I just skimmed the article, they replaced the Alexa toothbrush with an AI toothbrush. Lmao. EDIT 2: for the love of god stop pointing out that it says AI in the title of the post my app cut the second part off after the vertical bar so I did not see that.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 26,
        "text": "The voice activation on my smart bidet only works when I'm synced to the cloud, and only if I'm paying for the premium wash subscription. Welcome to the future.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 27,
        "text": "I really don't understand why every product needs to have Internet access? It's a god damn toothbrush! How many people bought this thing?? Your appliances and toothbrush don't need to have Internet access. I understand lighting but a toothbrush?? Wild.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 28,
        "text": "Looks like right to disconnect needs to be there along with right to repair (Really, all these things were supposed to be part of property rights. But apparently we can be denied those.)",
        "metatag": "user feedback"
      },
      {
        "comment_id": 29,
        "text": "You don't need a smart toothbrush. Just a simple rechargeable toothbrush is more than enough for me. My husband sticks to a basic manual toothbrush. I only upgraded because electric toothbrushes clean better and I want the healthiest teeth I can get.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 30,
        "text": "I'm just waiting for Amazon to discontinue Alexa entirely. They're losing about $10 billion PER YEAR on it. Cutting staff left, right and center and have no idea how to make any money from it. People aren't willing to buy items without even looking at a photo of it and it lacks the kind of feedback about what you've just ordered that people want before they confirm it. Not to mention how hard is it to reach for your phone and to open up the Amazon app? The only time you might order from it is to add to a grocery list.\n\nAlexa, add 4 pints semi-skimmed milk to the order.\n\nUnless of course you're a parrot who has worked out that they can order treats and food through it.\n\nhttps://www.silicon.co.uk/e-management/lay-off/amazon-cuts-hundreds-of-jobs-in-alexa-division-540453\nhttps://www.bbc.co.uk/newsround/46566019",
        "metatag": "user feedback"
      },
      {
        "comment_id": 31,
        "text": "Buying off an Alexa speaker kinda goes against common sense. We price shop, compare brands, and aren’t entirely brand loyal enough to buy blind. Spend more time than I care to admit comparing the charmin and Kirkland brand TP at Costco, there’s no way I would be willing to say “Alexa order tome toilet paper” without seeing a list of options. That doesn’t even take into account amazons infamous knockoff and low quality imitation brand problem.\n\nMaybe, just maybe if they had better integration, like me asking Alexa to show me product X on my tablet and my tablet suddenly opens the amazon app to that product so I can browse, then I might just make purchases. They would also have to address quantities, availability, and reasonable pricing along with ensuring the quality and truthfulness of the brands they carry. I just don’t see amazon having the will to clean up their mess enough to even consider buying something sight unseen.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 32,
        "text": "While I don't own this product and never would, I have been burned many times by similar ones in the past. From the MyQ garage door opener having it's API purposely bricked to force users into using their shitty ad filled app, to my Scotts 'smart' irrigation controller suddenly stop working because the company discontinued it WITHOUT notifying me, resulting in me only finding out a month after my grass hadn't been watered and started dying as a result.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 33,
        "text": "Some brands make products for people to use and some brands make products for people to buy. Yes, they’re all for-profit but there is a difference, and we need to recognize when a brand is just dropping some vaporware for which they’re gonna discontinue support in 2 years when it predictably fails to become the next big thing and they no longer give a shit about it or the people who bought it. Case in point: this, the Spotify Car Thing, and any hardware product snapchat has ever made.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 34,
        "text": "I've been using the same 'DUMB' electric toothbrush for at least five or six years. No connectivity, no app, no mode selection, no brushing-habits tracking, just 'on' and 'off'. No non-replaceable rechargeable battery, just cheap AAs.\n\nThe only maintenance needed is changing the brush heads every three months. And as long as the 'smart' toothbrushes cost upwards of $50, I expect I'll be able to get replacement heads for the foreseeable future.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 35,
        "text": "For everyone not reading the article, the charging base of the toothbrush functioned as an Echo device. Oral-B discontinued the app required to set that up.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 36,
        "text": "I bought the AI toothbrush because I’m an idiot and it’s the most stupid feature ever. It was advertised as scanning your mouth to make sure you never miss any spots. After about a week I noticed the 'AI' would show green on a portion of teeth when I barely touched that area so my next brush I just held the brush head in one spot and the entire area on the app lit up green which meant it was brushed sufficiently.. it’s a total scam and waste of money.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 37,
        "text": "Wife and I have oral-b electric toothbrushes. Both can connect to an app that tracks your brushing habits, suggests ways to improve and tells you if you’re pressing too hard. We both used the app one time then deleted it. Brushes work great a year later. I wouldn’t suggest buying a 'smart' toothbrush but the oral-b brushes we have are otherwise great.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 38,
        "text": "I saw that model, basically while brushing make a 3D tracking map of your teeths, and next brushes change intensity driving you to spots you didnt reached or cleaned like previous times\n\nFrom the product specifics\n\n'thanks to AI Artificial Intelligence, to monitor the brushing of the anterior, upper and posterior surfaces of the teeth; guides you towards the most complete cleaning possible.'",
        "metatag": "user feedback"
      },
      {
        "comment_id": 39,
        "text": "Eyy, that's my toothbrush! He looks after my teeth.\n\nLast time he was all like 'Damn Shazvox, you gotta brush better behind your molars. Your incisors looks good though'.\n\nNot sure if that's the AI or insanity though...\n\nBut then again, who cares? Good advice is good advice..",
        "metatag": "user feedback"
      },
      {
        "comment_id": 40,
        "text": "I kind of avoid shit like this.\n\nThey're marketing 'AI' into mundane stuff. Seems like snake oil tbh.\n\nWent to go look for a mattress recently. You can buy all sorts of fancy shit. Including a motorized base that comes with an app to monitor your sleep and have the 'AI' adjust the base for optimal sleep.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 41,
        "text": "It almost seems like 'AI capabilities' is one of those buzzwords that every marketing executive LOVES to throw into stuff but has little to no idea what it means. Kind of like how everything also uses 'blockchain' technology nowadays lol",
        "metatag": "user feedback"
      },
      {
        "comment_id": 42,
        "text": "I got this type of toothbrush for a family member as a gift. First thing it asks you to do when you open the box is to update the firmware… on your toothbrush.\n\nTechnology was a mistake.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 43,
        "text": "I mean, if it’s going to update every time I try to use it and download a ton of data before allowing me to do so, I’m going to be pissed. My phone is slow enough with the updates, I don’t need my toothbrush also needing to update every time I use it.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 44,
        "text": "I once owned a toothbrush that had an annoying timer which played a sound every 30 seconds to tell you to move on to the next quadrant of your mouth. It was supposed to help you brush for the recommended 2 minutes but it just became more of a nuisance than a helpful reminder. I went back to a simple, manual toothbrush. I don't think smart toothbrushes are worth it unless they have real, practical benefits beyond just tracking data.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 45,
        "text": "My electric toothbrush is pretty basic. It has a timer and a pressure sensor. That’s it. I don’t need it to connect to the Internet or analyze my brushing habits. It’s just a toothbrush. I think some of these smart toothbrushes are a bit of a gimmick, especially when they’re so expensive.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 46,
        "text": "I wonder if toothbrush companies will eventually start incorporating more health monitoring features like tracking gum health or detecting early signs of oral diseases. That could be a useful application of AI, but right now, most of the smart toothbrushes seem to be more about marketing gimmicks than real benefits.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 47,
        "text": "I got a smart toothbrush once that was supposed to help me with my brushing technique. It was more trouble than it was worth. The app was buggy, and the brush itself wasn’t any better than a regular one. I ended up going back to a standard electric toothbrush.",
        "metatag": "user feedback"
      },
      {
        "comment_id": 48,
        "text": "The smart toothbrush comes with a built-in pressure sensor that alerts you if you're brushing too hard. It really helps in preventing gum damage and ensures a more gentle brushing experience.",
        "metatag": "feature"
      },
      {
        "comment_id": 49,
        "text": "One of the standout features of this toothbrush is its customizable brushing modes. You can select modes for whitening, gum care, or sensitive teeth, making it versatile for different needs.",
        "metatag": "feature"
      },
      {
        "comment_id": 50,
        "text": "This smart toothbrush has a real-time brushing coach that provides feedback through the app. It tracks your brushing habits and offers tips for improvement, which is quite motivating.",
        "metatag": "feature"
      },
      {
        "comment_id": 51,
        "text": "I love how this toothbrush syncs with my phone via Bluetooth. It shows detailed brushing statistics and even reminds me when it's time to replace the brush head.",
        "metatag": "feature"
      },
      {
        "comment_id": 52,
        "text": "The built-in 2-minute timer on this smart toothbrush ensures you brush for the recommended duration. It also has a quad-pacer that prompts you to move to the next quadrant of your mouth every 30 seconds.",
        "metatag": "feature"
      },
      {
        "comment_id": 53,
        "text": "This toothbrush features a smart sensor that adjusts the brushing intensity based on your brushing habits. It’s perfect for those who need a bit more customization in their oral care routine.",
        "metatag": "feature"
      },
      {
        "comment_id": 54,
        "text": "I appreciate the long battery life of this smart toothbrush. It lasts for several weeks on a single charge and comes with a convenient travel case that also charges the brush.",
        "metatag": "feature"
      },
      {
        "comment_id": 55,
        "text": "The app integration allows this toothbrush to track your brushing frequency and duration over time, giving you insights into your oral health and encouraging better habits.",
        "metatag": "feature"
      },
      {
        "comment_id": 56,
        "text": "This toothbrush offers a unique feature where it can detect areas you might be missing while brushing and provide real-time feedback to ensure a thorough clean.",
        "metatag": "feature"
      },
      {
        "comment_id": 57,
        "text": "I’m impressed with the smart toothbrush's ability to sync with other health apps. It integrates seamlessly with my fitness tracker, providing a comprehensive overview of my health habits.",
        "metatag": "feature"
      },
      {
        "comment_id": 58,
        "text": "The smart toothbrush comes with multiple brush heads designed for different needs—whether you need a deep clean or gentle brushing for sensitive gums. It’s very customizable.",
        "metatag": "feature"
      },
      {
        "comment_id": 59,
        "text": "This toothbrush has an intuitive app interface that makes setting up your brushing profile a breeze. You can adjust settings, monitor your brushing history, and even set goals for oral hygiene.",
        "metatag": "feature"
      },
      {
        "comment_id": 60,
        "text": "A great feature of this toothbrush is its UV sanitizing station that keeps the brush heads germ-free. It adds an extra layer of cleanliness and hygiene to your oral care routine.",
        "metatag": "feature"
      },
      {
        "comment_id": 61,
        "text": "I like the built-in smart sensor that provides real-time feedback on brushing technique. It helps me make sure I'm brushing the right way to get the best results.",
        "metatag": "feature"
      },
      {
        "comment_id": 62,
        "text": "The customizable brushing timer on this smart toothbrush is fantastic. You can set different timers for different modes, ensuring you get the right amount of brushing time for each part of your mouth.",
        "metatag": "feature"
      },
      {
        "comment_id": 63,
        "text": "One of the best features of this smart toothbrush is its travel mode. It automatically adjusts the brush settings for travel and comes with a compact, charging travel case.",
        "metatag": "feature"
      },
      {
        "comment_id": 64,
        "text": "The smart toothbrush's LED display is a great addition. It shows brushing mode, battery life, and even a progress indicator during brushing, making it easy to use.",
        "metatag": "feature"
      },
      {
        "comment_id": 65,
        "text": "This toothbrush has a unique feature that detects your brushing angle and adjusts the vibration to ensure optimal cleaning efficiency. It's a game-changer for thorough brushing.",
        "metatag": "feature"
      },
      {
        "comment_id": 66,
        "text": "I love that this toothbrush has a built-in AI that can analyze your brushing patterns and offer personalized recommendations for improvement based on your habits.",
        "metatag": "feature"
      },
      {
        "comment_id": 67,
        "text": "The toothbrush comes with a smart app that provides a weekly report on your brushing habits, including areas that need more attention and overall brushing effectiveness.",
        "metatag": "feature"
      },
      {
        "comment_id": 68,
        "text": "One feature I find useful is the toothbrush's ability to sync with family profiles. It can track and analyze brushing habits for multiple users, making it ideal for households.",
        "metatag": "feature"
      },
      {
        "comment_id": 69,
        "text": "The smart toothbrush features a gentle mode specifically designed for sensitive teeth and gums. It's a thoughtful addition for those with dental concerns.",
        "metatag": "feature"
      },
      {
        "comment_id": 70,
        "text": "This toothbrush has a built-in timer that not only tracks the brushing duration but also divides it into quadrants to ensure each part of your mouth gets equal attention.",
        "metatag": "feature"
      },
      {
        "comment_id": 71,
        "text": "I’m impressed with the toothbrush's ability to automatically adjust its brushing intensity based on the user's brushing pressure, making it gentle yet effective.",
        "metatag": "feature"
      },
      {
        "comment_id": 72,
        "text": "The toothbrush comes with a wireless charging base that also acts as a sanitizing station, which is a great feature for maintaining brush hygiene.",
        "metatag": "feature"
      },
      {
        "comment_id": 73,
        "text": "This smart toothbrush offers real-time feedback on your brushing technique through the app. It’s like having a dental professional guide you every time you brush.",
        "metatag": "feature"
      },
      {
        "comment_id": 74,
        "text": "The toothbrush features a customizable brushing plan where you can set reminders for brushing and replace brush heads based on your dental health needs.",
        "metatag": "feature"
      },
      {
        "comment_id": 75,
        "text": "A cool feature is the toothbrush's ability to pair with voice assistants like Alexa or Google Assistant. You can control brushing modes and get updates using voice commands.",
        "metatag": "feature"
      },
      {
        "comment_id": 76,
        "text": "This toothbrush includes a travel lock feature to prevent accidental activation while on the go. It’s a small but useful addition for frequent travelers.",
        "metatag": "feature"
      },
      {
        "comment_id": 77,
        "text": "The smart toothbrush has an integrated AI that learns from your brushing habits and adjusts its settings to provide a more personalized brushing experience over time.",
        "metatag": "feature"
      },
      {
        "comment_id": 78,
        "text": "One of the best features is the smart pressure sensor that alerts you if you’re brushing too hard, helping to protect your gums from potential damage.",
        "metatag": "feature"
      },
      {
        "comment_id": 79,
        "text": "The toothbrush has a long battery life and comes with a compact charging stand that is perfect for traveling. It’s convenient and ensures you never run out of charge.",
        "metatag": "feature"
      }
    ]
  }
  